research/visualization_methods/outputs/Bayesian Linear Regression__linear_regression/linear_regression.mmd
graph TD
  Normal["Normal"]
  a["a"]
  b["b"]
  mean["mean"]
  variance["variance"]
  x["x"]
  y["y"]
  y ["y "]
  Normal --> a
  Normal --> b
  Normal --> y
  Normal --> y 
  a --> y
  a --> y 
  b --> y
  b --> y 
  mean --> a
  mean --> b
  mean --> y
  mean --> y 
  variance --> a
  variance --> b
  variance --> y
  variance --> y 
  x --> y
  x --> y 
